app/controllers/users/registrations_controller.rb

  def google_signup
    user = params[:user]

    @user = User.find_or_initialize_by(email: user[:email])
    if @user.new_record?
      @user.profile_picture = user[:photoURL]
      @user.first_name = user[:displayName]
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'rajesh@gmail.com' LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'rajeshpushpakar01@gmail.com' LIMIT 1